{"keras_version": "2.2.4", "backend": "tensorflow", "class_name": "Sequential", "config": {"layers": [{"class_name": "Conv2D", "config": {"filters": 32, "dilation_rate": [1, 1], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "kernel_constraint": null, "activation": "linear", "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "batch_input_shape": [null, 32, 32, 3], "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "dtype": "float32", "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_1", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_1"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "scale": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "name": "batch_normalization_1", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"filters": 32, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_2", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_2"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "scale": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "name": "batch_normalization_2", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_1", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.2, "seed": null, "name": "dropout_1"}}, {"class_name": "Conv2D", "config": {"filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_3", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_3"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "scale": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "name": "batch_normalization_3", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"filters": 64, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_4", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_4"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "scale": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "name": "batch_normalization_4", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_2", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.3, "seed": null, "name": "dropout_2"}}, {"class_name": "Conv2D", "config": {"filters": 128, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_5", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_5"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "scale": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "name": "batch_normalization_5", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "Conv2D", "config": {"filters": 128, "dilation_rate": [1, 1], "kernel_constraint": null, "activation": "linear", "use_bias": true, "padding": "same", "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_size": [3, 3], "kernel_regularizer": {"class_name": "L1L2", "config": {"l2": 9.999999747378752e-05, "l1": 0.0}}, "bias_regularizer": null, "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "strides": [1, 1], "bias_constraint": null, "activity_regularizer": null, "name": "conv2d_6", "data_format": "channels_last"}}, {"class_name": "Activation", "config": {"trainable": true, "activation": "elu", "name": "activation_6"}}, {"class_name": "BatchNormalization", "config": {"trainable": true, "moving_mean_initializer": {"class_name": "Zeros", "config": {}}, "gamma_constraint": null, "beta_constraint": null, "scale": true, "center": true, "moving_variance_initializer": {"class_name": "Ones", "config": {}}, "axis": -1, "epsilon": 0.001, "beta_regularizer": null, "name": "batch_normalization_6", "momentum": 0.99, "gamma_regularizer": null, "beta_initializer": {"class_name": "Zeros", "config": {}}, "gamma_initializer": {"class_name": "Ones", "config": {}}}}, {"class_name": "MaxPooling2D", "config": {"trainable": true, "name": "max_pooling2d_3", "strides": [2, 2], "data_format": "channels_last", "pool_size": [2, 2], "padding": "valid"}}, {"class_name": "Dropout", "config": {"trainable": true, "noise_shape": null, "rate": 0.4, "seed": null, "name": "dropout_3"}}, {"class_name": "Flatten", "config": {"trainable": true, "name": "flatten_1", "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"units": 10, "bias_constraint": null, "kernel_constraint": null, "activation": "softmax", "kernel_initializer": {"class_name": "VarianceScaling", "config": {"seed": null, "scale": 1.0, "distribution": "uniform", "mode": "fan_avg"}}, "trainable": true, "bias_initializer": {"class_name": "Zeros", "config": {}}, "use_bias": true, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "name": "dense_1"}}], "name": "sequential_1"}}